tests/Mock/ExtendedFetchSubscriptionMultipleChargesSuccess.txt

HTTP/1.1 200 OK
Date: Mon, 17 Apr 2017 21:55:18 GMT
Server: Apache
Set-Cookie: JSESSIONID=1234567890ABCDEF1234567890ABCDEF; Path=/services/; Secure; HttpOnly
Transfer-Encoding: chunked
Content-Type: application/xml
Vary: Accept-Encoding
Strict-Transport-Security: max-age=31536000 ; includeSubDomains

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<subscription xmlns="http://ws.plimus.com">
  <subscription-id>[SUBSCRIPTION_REFERENCE]</subscription-id>
  <status>A</status>
  <underlying-sku-id>1234567</underlying-sku-id>
  <shopper-id>[CUSTOMER_REFERENCE]</shopper-id>
  <credit-card>
    <card-last-four-digits>0000</card-last-four-digits>
    <card-type>JCB</card-type>
  </credit-card>
  <catalog-recurring-charge>
    <currency>[CURRENCY]</currency>
    <amount>[AMOUNT]</amount>
  </catalog-recurring-charge>
  <charge-frequency>ANNUALLY</charge-frequency>
  <next-charge-date>[NEXT_CHARGE_DATE]</next-charge-date>
  <auto-renew>true</auto-renew>
  <last-charge-result>
    <result-code>SUCCESS</result-code>
  </last-charge-result>
  <subscription-charges>
    <subscription-charge>
       <charge-info />
       <charge-invoice-info>
          <date-created>11-Nov-15</date-created>
          <invoice-id>[TRANSACTION_REFERENCE_1]</invoice-id>
          <invoice-amount>5.00</invoice-amount>
          <invoice-currency>USD</invoice-currency>
       </charge-invoice-info>
    </subscription-charge>
      <subscription-charge>
       <charge-info />
       <charge-invoice-info>
          <date-created>11-Nov-14</date-created>
          <invoice-id>[TRANSACTION_REFERENCE_2]</invoice-id>
          <invoice-amount>5.00</invoice-amount>
          <invoice-currency>USD</invoice-currency>
       </charge-invoice-info>
    </subscription-charge>
  </subscription-charges>
</subscription>
